In [1]:
import pandas as pd

In [2]:
# task 3
data = {
    "Name": ["Aidar", "Arsen", "Daur", "Aldik", "Dana"],
    "Age": [19, 21, 22, 20, 23],
    "Score": [75, 88, 92, 81, 67]
}

df = pd.DataFrame(data)
df

    Name  Age  Score
0  Aidar   19     75
1  Arsen   21     88
2   Daur   22     92
3  Aldik   20     81
4   Dana   23     67

In [3]:
# task 4
# first 3 rows
df.head(3)

    Name  Age  Score
0  Aidar   19     75
1  Arsen   21     88
2   Daur   22     92

In [4]:
# sum statistics
df.describe()

             Age      Score
count   5.000000   5.000000
mean   21.000000  80.600000
std     1.581139  10.014989
min    19.000000  67.000000
25%    20.000000  75.000000
50%    21.000000  81.000000
75%    22.000000  88.000000
max    23.000000  92.000000

In [5]:
# avg score
average_score = df["Score"].mean()
print("Average Score:", average_score)

Average Score: 80.6

In [6]:
# task 5
# students older than 20
df[df["Age"] > 20]
# score > 80
df[df["Score"] > 80]

    Name  Age  Score
1  Arsen   21     88
2   Daur   22     92
3  Aldik   20     81

In [7]:
# task 5
# students older than 20
df[df["Age"] > 20]

    Name  Age  Score
1  Arsen   21     88
2   Daur   22     92
4   Dana   23     67

In [8]:
# score > 80
df[df["Score"] > 80]

    Name  Age  Score
1  Arsen   21     88
2   Daur   22     92
3  Aldik   20     81